""" 2. Петя, Катя и Сережа делают из бумаги журавликов.           in     out        in     out           in     out
Вместе они сделали S журавликов.                                  6      1 4 1      24     4 16 4        60     10 40 10
Сколько журавликов сделал каждый ребенок, если известно, 
что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, 
чем Петя и Сережа вместе?
 """

NumberOfCrane = int(input("Введите количество журавликов\n"))
print(NumberOfCrane//6, (NumberOfCrane*2)//3, NumberOfCrane//6)
